"""
定义模板:
        变量:就是视图传递给模板的数据,要遵守标识符规则,语法:{{var}} 这时候会计算出变量的值之后放置在这里
            注意:如果使用的var不存在,则此时传递的是空字符串,在模板中使用的点语法(包括字典查询,属性或者方法,数字索引)但是传递最多的就是对象
            在模板中调用对象的方法:在models里面写了之后再创建的页面上直接调用方法,但是注意在模板里写函数的时候,不能传递参数

        标签:
            语法{% tag%}
            作用:在输出中创建一些文本;控制逻辑和循环
            if: 1.格式{% if 表达式%}
                    语句
                    {%endif%}
                2.{% if 表达式%}
                    语句
                    {%else%}
                    语句
                    {%endif%}

            for:格式:
                1.{% for 变量 in 列表%}
                语句
                {%endfor%}
                2.{% for 变量 in 列表%}
                语句
                {%empty%}
                语句  //此处的执行需要列表是空或者列表不存在的时候才会执行
                {%endfor%}
                3.{{forloop.counter}}  表示的是当前是第几次循环

            comment:格式:
                    {%comment%}
                    注释的内容
                    {%endcomment%}  表示的是注释多行

            ifequel:格式:
                    {%ifequal 值1 值2%}
                    语句
                    {%endifequal%}  表示的是判断上述两个值是否相等,如果相等,就执行下面的语句,不相等就不执行
            ifnotequel:

            include:加载模板且以标签内的参数渲染
                    格式:{%include '模板目录' 参数1 参数2%}
                        {%endinclude%}

            url:反向解析
                    格式:{%url 'namespace' p1 p2%}

            csrf_token:用于跨站请求伪造保护
                    格式:{%csrf_token%}

            block,extends:表示的是用于模板的继承

            autoescape:用于HTML的转义,autoescape off表示的是将字符串转义关闭

        过滤器:
            语法:{{var|过滤器}}
            作用:在变量被显示之前修改他
            过滤器也可以传递参数,参数用引号引起来,
                    join:属性|join:'#'
            如果一个变量没有被提供,或者值是false,即是空的,那么就可以使用默认值
                    default:格式{{var|default:'good'}}
            根据给定格式转换日期为字符串:date  格式:{{dateVar|date:'y-m-d'}}
            HTML转义:escape
            加减乘除

        注释:
            单行注释:语法:
                    {##}
            多行注释:

        反向解析:以前是先有url,之后url再去匹配views,之后视图再去查找模板template,模板里面含有一些a标签,但是要是网址没有写死,可以变动,那么网址可以推理出来,就是namespace表示的就是反向解析

        模板继承:基本用于移动端
            可以减少页面内容的重复定义,实现页面的重用,一个网站的页面含有header和footer.但是如果是个网站的都一样,那么就可以使用模板函数,
            block标签:表示的是在模板中预留区域,子模板去填充
            extends标签:表示的是继承模板,需要写在模板文件的第一行
            实例:定义模板
                第一子模板{% block main %}

                {% endblock main %}

                {% extends 父模板路径%}

        HTML转义:在indexM里面找到code,直接将得到的code当成普通的字符串渲染了,但是现在想要实现的是转成h1标签渲染,HTML转义:escape转成字符串,safe转成HTML语句...同时

        CSRF:表示的是跨栈请求伪造,一些恶意的网站包含了链接,表单,按钮,利用登录的用户在浏览器中认证,从而攻击服务
            防止CSRF的两种方式:但是settings里面已经防止了
                            第二种方式:

        验证码:作用:在用户注册的时候,登录页面的时候使用,为了防止暴力请求,减轻服务器的压力,也是防止CSRF


"""